Documents/РеализацияОпционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РеализацияОпционов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеОпционы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отвественный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадрыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоОпционов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстатокОпционовВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПакетОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПакетыОпционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДержательОпционов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДержателиОпционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РеализацияОпционов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
			//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.ПакетОпционов = ПакетОпционов;
	Движение.ДержательОпционов = ПакетОпционов.Держатель;
	Движение.ДатаПродажи = Дата;
	Движение.КоличествоОпционов = Количество;
	Движение.ОстатокОпционовВПакете = ДоступныеОпционы-Количество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 	
	
	ОбъектДержателя = ЭтотОбъект.ПакетОпционов.Держатель.ПолучитьОбъект();
	АдресПолучателя = ОбъектДержателя.Почта;  
	ФИОПолучателя = ОбъектДержателя.ФИО;  
	ОбъектПакета = ЭтотОбъект.ПакетОпционов.ПолучитьОбъект();
	Если ЭтотОбъект.ПричинаОтклонения <> "" Тогда
		ТемаПисьма = "Заявка на продажу опционов отклонена❌";

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " + Символы.ПС +   Символы.ПС +       
		              "Ваша заявка на продажу опционов №" + ЭтотОбъект.НомерЗаявки + " отклонена по причине '" + ЭтотОбъект.ПричинаОтклонения + "'❌." + Символы.ПС + Символы.ПС +
					  "Детали заявки: " +  Символы.ПС +	  
					  "⏰Дата оформления заявки: " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС +
					  "✉️ Пакет опционов: " + ОбъектПакета.Код + " (" + ЭтотОбъект.ПакетОпционов + ")." +  Символы.ПС + Символы.ПС + 
					"⚠️Если у вас возникли вопросы, пожалуйста, сообщите в службу поддержки:" +  Символы.ПС + 
					            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";

       	Иначе
		ТемаПисьма = "Заявка на продажу опционов одобрена✅";

		ТекстПисьма = "Уважаемый(ая) " + ФИОПолучателя + ", " +  Символы.ПС + Символы.ПС +	        
		              "Ваша заявка на продажу опционов №" + ЭтотОбъект.НомерЗаявки + " успешно одобрена✅" + Символы.ПС + Символы.ПС +
					  "Детали заявки: " +  Символы.ПС +	  
					  "⏰Дата оформления заявки: " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy") + "." +  Символы.ПС + 
					"✨Наименование пакета опционов: " + ЭтотОбъект.ПакетОпционов + "." +  Символы.ПС + 
					  "⭐ Количество проданных опционов : " + ЭтотОбъект.Количество + " шт." +  Символы.ПС +
					"☺️Остаток опционов в пакете: " + ЭтотОбъект.ПакетОпционов.ОстатокОпционов + " шт." +  Символы.ПС + Символы.ПС + 
					"⚠️Если у вас возникли вопросы, пожалуйста, сообщите в службу поддержки:" +  Символы.ПС + 
		            "✉️ ESOP-1C-men@yandex.ru" + Символы.ПС + Символы.ПС +
					"С уважением," + Символы.ПС +
					"Команда ООО «Профи.pу»❤️";

	КонецЕсли;  
		
МодульПочты.ОтправитьПисьмо(АдресПолучателя, ТемаПисьма, ТекстПисьма);
	
КонецПроцедуры
